assets/stresstest/result
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        ElectOneAPI
Server Hostname:        localhost
Server Port:            3000
SSL/TLS Protocol:       TLSv1.3,TLS_AES_128_GCM_SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        localhost

Document Path:          /api/castVote
Document Length:        41 bytes

Concurrency Level:      10
Time taken for tests:   0.079 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      203 bytes
Total body sent:        2145
HTML transferred:       41 bytes
Requests per second:    12.60 [#/sec] (mean)
Time per request:       793.850 [ms] (mean)
Time per request:       79.385 [ms] (mean, across all concurrent requests)
Transfer rate:          2.50 [Kbytes/sec] received
                        26.39 kb/s sent
                        28.88 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        5    5   0.0      5       5
Processing:    43   43   0.0     43      43
Waiting:       42   42   0.0     42      42
Total:         48   48   0.0     48      48